print("давай зіграємо в вікторину")

while True:
    nachalo = input("Почнемо гру? (так,ні): ") 
    if nachalo == 'ні':
        print("Завершення гри")
    if nachalo == 'так':
        a = input("Що в середині кабачка? ")
        if a == 'а':
            print("Вірно") 
        else:
            print("Не вірно")
        b = input("Скільки міст в Англії? ")
        if b == '51':
            print("Вірно")
        else:
            print("Не вірно")
        c = input("В якій країні були проведені перші Олімпійські ігри? ")
        if c == 'Греція':
            print("Вірно")
        else:
            print("Не вірно")
        d = input("Олімпіада проводиться кожні скільки років? ")
        if d == 'Чотири':
            print("Вірно")
        else:
            print("Не вірно")
        e = input("Яким видом спорту, яким займаються на мітлі, займається Гаррі Поттер? ")
        if e == 'квідич':
            print("Вірно")
        else:
            print("Не вірно")
        if a == 'а' and b == '51' and c == 'Греція' and d == 'Чотири' and e == 'квідич':
            print("Ти геній ")
        else:
            print("Гарна спроба ")    